{
  "OVERLAY": {
    "SACRED_RITUAL_SITE": {
      "NAME": "Sacred Ritual Site",
      "DESCRIPTION": "A place where ancient rituals were performed, still radiating spiritual energy.",
      "F1": {
        "TITLE": "Circle of Stones",
        "DESCRIPTION": "A ring of carved stones forms a perfect circle. Flowers grow between the cracks, untouched by time.",
        "OBSERVE": {
          "DESCRIPTION": "You walk the perimeter, noticing faint inscriptions.",
          "SUCCESS": "The markings glow softly, revealing a blessing of vitality.",
          "FAILURE": "You trip over a root, snapping a flower stem. The air cools disapprovingly."
        },
        "PRAY": {
          "DESCRIPTION": "You kneel among the stones and whisper a simple prayer."
        }
      },
      "F2": {
        "TITLE": "Heart of the Grove",
        "DESCRIPTION": "A soft hum fills the air. In the center lies an ancient bowl filled with clear water.",
        "INTERACT": {
          "DESCRIPTION": "You drink a handful of the sacred water.",
          "SUCCESS": "Warmth spreads through you, your spirit feels renewed.",
          "FAILURE": "The water tastes bitter, something inside you trembles briefly."
        }
      }
    },
    "DARK_RITUAL_CIRCLE": {
      "NAME": "Dark Ritual Circle",
      "DESCRIPTION": "A sinister site marked by dark symbols, hinting at forbidden practices. The ground itself seems to hum with lingering energy.",
      "F1": {
        "TITLE": "Outer Ring",
        "DESCRIPTION": "Candles flicker though no wind blows. The scent of burnt incense fills the air, and faint chanting echoes as if from beneath the earth.",
        "OBSERVE": {
          "DESCRIPTION": "You kneel by the runes. They pulse faintly, resonating with your heartbeat...",
          "SUCCESS": "The whisper grows clearer, not hostile, merely curious. You sense awareness within the stones."
        }
      },
      "F2": {
        "TITLE": "Blood Altar",
        "DESCRIPTION": "A stone altar stands at the center, stained with ancient blood. Strange runes glow faintly as you approach. You hear a whisper—soft, pleading, or perhaps tempting.",
        "INTERACT": {
          "DESCRIPTION": "You place your hand upon the altar. It feels warm, alive.",
          "SUCCESS": "The blood sigils flare, then fade. A whisper thanks you before vanishing.",
          "FAILURE": "A searing pain shoots up your arm! The altar rejects you."
        },
        "PRAY": {
          "DESCRIPTION": "You close your eyes and pray. The air hums with strange energy...",
          "SUCCESS": "You feel harmony with the forces here. Something within you strengthens.",
          "FAILURE": "Your prayer is swallowed by silence. The circle grows cold and still."
        }
      },
      "F3": {
        "TITLE": "Awakening",
        "DESCRIPTION": "The runes ignite in crimson light, and a spectral form begins to rise from the altar."
      }
    },
    "NATURE_ALTAR": {
      "NAME": "Nature's Altar",
      "DESCRIPTION": "An altar dedicated to nature spirits, surrounded by lush moss and flickering fireflies.",
      "F1": {
        "TITLE": "Whispering Grove",
        "DESCRIPTION": "A wind stirs the leaves though the air is still. The scent of earth and sap overwhelms your senses.",
        "OBSERVE": {
          "DESCRIPTION": "You notice claw marks on the altar, something wild has been here recently."
        },
        "PRAY": {
          "DESCRIPTION": "You place your hands on the bark-carved runes and speak softly.",
          "SUCCESS": "The ground trembles slightly, vines curl protectively around you.",
          "FAILURE": "Thorns prick your palms, nature rejects your touch."
        }
      },
      "F2": {
        "TITLE": "The Guardian's Challenge",
        "DESCRIPTION": "From the shadows emerges a massive boar spirit, eyes burning with primal defiance."
      }
    },
    "CELESTIAL_OBSERVATORY": {
      "NAME": "Celestial Observatory",
      "DESCRIPTION": "A site aligned with the stars, used for celestial rituals and ceremonies.",
      "F1": {
        "TITLE": "Starlit Terrace",
        "DESCRIPTION": "Massive mirrors and lenses point toward the heavens. A faint hum echoes as the stars align.",
        "INSPECT": {
          "DESCRIPTION": "You look through one of the cracked lenses.",
          "SUCCESS": "You glimpse constellations shifting, revealing a hidden sigil in the stars.",
          "FAILURE": "The lens flares blinding light, your eyes sting painfully."
        },
        "PRAY": {
          "DESCRIPTION": "You whisper a vow to the sky."
        }
      },
      "F2": {
        "TITLE": "Astral Rift",
        "DESCRIPTION": "The ground cracks, and light pours upward, something descends instead of rising."
      }
    },
    "ELEMENTAL_SHRINE": {
      "NAME": "Elemental Shrine",
      "DESCRIPTION": "A shrine dedicated to the elemental forces, with signs of recent activity.",
      "F1": {
        "TITLE": "Ritual of Balance",
        "DESCRIPTION": "Four braziers burn in different colors, red, blue, green, and gold. One flickers weakly.",
        "INTERACT": {
          "DESCRIPTION": "You adjust the golden brazier.",
          "SUCCESS": "The flames synchronize, forming a perfect circle of light.",
          "FAILURE": "The flames roar up suddenly, singing your hair!"
        },
        "OBSERVE": {
          "DESCRIPTION": "The colors twist like serpents, beautiful and threatening."
        }
      },
      "F2": {
        "TITLE": "Unstable Core",
        "DESCRIPTION": "The air grows hot. Cracks of lightning flash across the stones. The shrine trembles violently."
      }
    },
    "ECLIPSE_RITE": {
      "NAME": "The Eclipse Rite",
      "DESCRIPTION": "A vast stone circle bathed in twilight, where the sun and moon share the same sky. Ancient chants echo from unseen throats.",
      "F1": {
        "TITLE": "The Twilight Gathering",
        "DESCRIPTION": "Dozens of hooded silhouettes sway in rhythm. The horizon glows faintly purple, neither dawn nor dusk.",
        "OBSERVE": {
          "DESCRIPTION": "You feel pulled by two forces, warmth from one side, chill from the other."
        },
        "TALK": {
          "DESCRIPTION": "You whisper to one of the figures, but they chant in unison, ignoring you."
        }
      },
      "F2": {
        "TITLE": "The Altar of Duality",
        "DESCRIPTION": "At the center lies an obsidian altar split in two halves, one scorched black, one pale as bone.",
        "INTERACT": {
          "DESCRIPTION": "You place your hand between light and shadow.",
          "SUCCESS": "Both sides pulse, your body vibrates with opposing energy.",
          "FAILURE": "A jolt surges through you, your vision blurs in white and black."
        },
        "INSPECT": {
          "DESCRIPTION": "Runes spiral around the altar: 'Unity through division. Harmony through pain.'"
        }
      },
      "F3": {
        "TITLE": "The Eclipse Approaches",
        "DESCRIPTION": "The air darkens unnaturally fast. The hooded figures raise their arms, the sun trembles.",
        "PRAY": {
          "DESCRIPTION": "You whisper a plea to the heavens, the sky does not answer."
        },
        "INTERACT": {
          "DESCRIPTION": "You mirror their gesture, something stirs inside you.",
          "SUCCESS": "A perfect eclipse forms overhead, a halo of fire around darkness.",
          "FAILURE": "You feel faint, reality seems to stretch like fabric."
        }
      },
      "F4": {
        "TITLE": "The Avatar of Balance",
        "DESCRIPTION": "The figures collapse. From the altar rises a being of pure twilight, half light, half shadow."
      },
      "F5": {
        "TITLE": "Afterglow of the Eclipse",
        "DESCRIPTION": "The sky clears. A faint, shimmering ring lingers in the heavens, marking the spot where day and night once kissed.",
        "OBSERVE": {
          "DESCRIPTION": "The ring hums softly, you feel calm and sharp all at once."
        },
        "PRAY": {
          "DESCRIPTION": "You thank the silent heavens, and feel them briefly answer."
        }
      }
    },
    "THOUSAND_HANDS_CEREMONY": {
      "NAME": "The Thousand Hands Ceremony",
      "DESCRIPTION": "An underground hall lined with statues of monks, each holding a candle. Their eyes gleam faintly in the dark.",
      "F1": {
        "TITLE": "Hall of Quiet Flame",
        "DESCRIPTION": "A low chant fills the chamber, but there's no one here. The candles flicker in unison.",
        "OBSERVE": {
          "DESCRIPTION": "You realize every statue has a unique expression, sorrow, rage, fear."
        },
        "INTERACT": {
          "DESCRIPTION": "You light a candle that has gone out.",
          "SUCCESS": "The nearest statue's eyes brighten, it almost smiles.",
          "FAILURE": "Wax melts across your hand, the flame hisses angrily."
        }
      },
      "F2": {
        "TITLE": "The Whisper of Stone",
        "DESCRIPTION": "A murmur runs through the hall, hundreds of lips carved in marble whisper your name.",
        "PRAY": {
          "DESCRIPTION": "You bow instinctively, the whisper stops for a moment."
        },
        "OBSERVE": {
          "DESCRIPTION": "The statues' hands have shifted slightly, all pointing toward the central dais."
        }
      },
      "F3": {
        "TITLE": "The Central Idol",
        "DESCRIPTION": "A towering figure with a thousand arms rises before you, each hand holding a tool, a flame, or a weapon.",
        "INSPECT": {
          "DESCRIPTION": "You count the hands. When you look back, the number has changed."
        },
        "INTERACT": {
          "DESCRIPTION": "You touch the base of the statue, the entire hall trembles.",
          "SUCCESS": "The idol lowers one hand and offers a glowing pearl.",
          "FAILURE": "A crack splits the idol's chest, dust pours out like blood."
        }
      },
      "F4": {
        "TITLE": "The Hand of Judgement",
        "DESCRIPTION": "The statues rise from their pedestals, moving with creaking grace, silent, purposeful."
      },
      "F5": {
        "TITLE": "The Last Candle",
        "DESCRIPTION": "Only one flame remains, burning atop the shattered idol. The air smells of stone and incense.",
        "OBSERVE": {
          "DESCRIPTION": "The flame folds inward, forming a pearl of wax. You pocket it."
        },
        "REST": {
          "DESCRIPTION": "You breathe calmly, feeling watched, but at peace."
        }
      }
    }
  }
}
