{
  "VILLAGE": {
    "OAKWOOD": {
      "NAME": "La Chênaie",
      "DESCRIPTION": "La Chênaie se niche sous de majestueux chênes, ses cottages se fondant dans l'étreinte paisible de la forêt. C'est un ancien village mais il est plein de charme."
    },
    "PINEHILL": {
      "NAME": "Pincolline",
      "DESCRIPTION": "Le doux village de Pincolline surplombe les bois vallonnés, où le parfum des pins flotte dans chaque sentier étroit."
    },
    "CEDARBROOK": {
      "NAME": "Rivecèdre",
      "DESCRIPTION": "Rivecèdre se niche au bord d'un ruisseau paisible, ses ponts de bois craquant doucement sous le passage des voyageurs."
    },
    "MAPLECROSS": {
      "NAME": "Feucroix",
      "DESCRIPTION": "Feucroix se situe au croisement de deux chemins, ses arbres aux feuilles rouges accueillant les promeneurs dans une douce chaleur."
    },
    "BIRCHFIELD": {
      "NAME": "Bouleaugris",
      "DESCRIPTION": "Bouleaugris s'étend sur des prairies dorées, ses arbres pâles scintillant sous la lumière du matin."
    },
    "DARKROAD": {
      "NAME": "Sombrevoie",
      "DESCRIPTION": "Le village de Sombrevoie se situe à la lisière d'un bois ombragé, où les voyageurs trouvent refuge contre la nuit qui s'installe."
    },
    "WOODENPALE": {
      "NAME": "Boispâle",
      "DESCRIPTION": "La scintillante Boispâle est un village paisible aux maisons en bois, dont les rues sont bordées de lanternes qui brillent doucement au crépuscule."
    },
    "SANDBLOOM" :{
      "NAME": "Sablefleur",
      "DESCRIPTION": "Sablefleur est l'un des rares villages situés dans le désert. Niché dans une oasis, il abrite toutes sortes de créatures ou simplement des âmes perdues."
    },
    "HIGHPEAK" :{
      "NAME": "Hautepic",
      "DESCRIPTION": "Accrochée à flanc de montagne, Hautepic abrite mineurs et voyageurs intrépides. Ses maisons de pierre résistent aux vents glacés qui balaient les hauteurs."
    },
    "GREENRISE" :{
      "NAME": "Montvert",
      "DESCRIPTION": "Suspendue aux branches d'arbres géants, Montvert s'étend sur un réseau de passerelles en bois suspendues. Ses habitants vivent en hauteur, guidés par l'esprit de la forêt profonde."
    }
  }
}